app/Controllers/Anggota.php

SELECT *
FROM `anggota`
WHERE `user_id` IS NULL
 LIMIT 1
---
    public function editProfil()
    {
        $anggotaModel = new \App\Models\AnggotaModel();

        $id_user = session()->get('id');

        $data['anggota'] = $anggotaModel
            ->where('user_id', $id_user)
            ->first();