app/Controllers/Buku.php

    public function create()
    {
        $kategoriModel = new \App\Models\KategoriModel();
        $penulisModel = new \App\Models\PenulisModel();
        $penerbitModel = new \App\Models\PenerbitModel();
        $RakModel = new \App\Models\RakModel();

        $data = [
            'kategori' => $kategoriModel->findAll(),
            'penulis' => $penulisModel->findAll(),
            'penerbit' => $penerbitModel->findAll(),
            'rak' => $RakModel->findAll(),
        ];
---
SELECT *
FROM `kategori`
SELECT *
FROM `penulis`
SELECT *
FROM `penerbit`

    public function index()
    {
        $keyword = $this->request->getGet('keyword');
        $kategori = $this->request->getGet('kategori');

        $builder = $this->bukuModel
            ->select('buku.*, kategori.nama_kategori, penulis.nama_penulis, penerbit.nama_penerbit, rak.nama_rak')
            ->join('kategori', 'kategori.id_kategori = buku.id_kategori', 'left')
            ->join('penulis', 'penulis.id_penulis = buku.id_penulis', 'left')
            ->join('penerbit', 'penerbit.id_penerbit = buku.id_penerbit', 'left')

            // 🔥 INI YANG PENTING
            ->join('buku_rak', 'buku_rak.id_buku = buku.id_buku', 'left')
            ->join('rak', 'rak.id_rak = buku_rak.id_rak', 'left');
        // FILTER JUDUL
        if ($keyword) {
            $builder->like('buku.judul', $keyword);
        }

        // FILTER KATEGORI
        if ($kategori) {
            $builder->where('buku.id_kategori', $kategori);
        }

        $data['buku'] = $builder->paginate(10);
        $data['pager'] = $this->bukuModel->pager;

        // kirim data kategori ke view
        $kategoriModel = new \App\Models\KategoriModel();
        $data['kategori'] = $kategoriModel->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `buku`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `buku`.`id_kategori`
LEFT JOIN `penulis` ON `penulis`.`id_penulis` = `buku`.`id_penulis`
LEFT JOIN `penerbit` ON `penerbit`.`id_penerbit` = `buku`.`id_penerbit`
LEFT JOIN `buku_rak` ON `buku_rak`.`id_buku` = `buku`.`id_buku`
LEFT JOIN `rak` ON `rak`.`id_rak` = `buku_rak`.`id_rak`
SELECT `buku`.*, `kategori`.`nama_kategori`, `penulis`.`nama_penulis`, `penerbit`.`nama_penerbit`, `rak`.`nama_rak`
FROM `buku`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `buku`.`id_kategori`
LEFT JOIN `penulis` ON `penulis`.`id_penulis` = `buku`.`id_penulis`
LEFT JOIN `penerbit` ON `penerbit`.`id_penerbit` = `buku`.`id_penerbit`
LEFT JOIN `buku_rak` ON `buku_rak`.`id_buku` = `buku`.`id_buku`
LEFT JOIN `rak` ON `rak`.`id_rak` = `buku_rak`.`id_rak`
 LIMIT 10
SELECT *
FROM `kategori`