app/Controllers/Denda.php

    public function index()
    {
        $search = $this->request->getGet('search');
        $role = session()->get('role');
        $id_user = session()->get('id');

        $builder = $this->dendaModel
            ->select('denda.*, peminjaman.id_peminjaman, anggota.nama as nama_anggota, petugas.nama as nama_petugas_verif')
            ->join('peminjaman', 'peminjaman.id_peminjaman = denda.id_peminjaman', 'left')
            ->join('anggota', 'anggota.id_anggota = peminjaman.id_anggota', 'left')
            ->join('users as petugas', 'petugas.id = denda.id_petugas_verif', 'left');

        // 🔒 filter anggota
        if ($role == 'anggota') {
            $builder->where('peminjaman.id_anggota', $id_user);
        }
        // 🔒 filter anggota
        if ($role == 'anggota') {
            $builder->where('peminjaman.id_anggota', $id_user);
        }

        // 🔍 search
        if ($search) {
            $builder->groupStart()
                ->like('users.nama', $search)
                ->orLike('peminjaman.id_peminjaman', $search)
                ->groupEnd();
        }

        // 🔔 NOTIFIKASI
        $notif = $this->dendaModel
            ->where('status_denda', 'menunggu verifikasi')
            ->countAllResults();

        $data = [
            'denda' => $builder->findAll(),
            'search' => $search,
            'notif' => $notif
        ];
---
SELECT `denda`.*, `peminjaman`.`id_peminjaman`, `anggota`.`nama` as `nama_anggota`, `petugas`.`nama` as `nama_petugas_verif`
FROM `denda`
LEFT JOIN `peminjaman` ON `peminjaman`.`id_peminjaman` = `denda`.`id_peminjaman`
LEFT JOIN `anggota` ON `anggota`.`id_anggota` = `peminjaman`.`id_anggota`
LEFT JOIN `users` as `petugas` ON `petugas`.`id` = `denda`.`id_petugas_verif`
SELECT COUNT(*) AS `numrows`
FROM `denda`
LEFT JOIN `peminjaman` ON `peminjaman`.`id_peminjaman` = `denda`.`id_peminjaman`
LEFT JOIN `anggota` ON `anggota`.`id_anggota` = `peminjaman`.`id_anggota`
LEFT JOIN `users` as `petugas` ON `petugas`.`id` = `denda`.`id_petugas_verif`
WHERE `peminjaman`.`id_anggota` = '24'
AND `peminjaman`.`id_anggota` = '24'
AND `status_denda` = 'menunggu verifikasi'
SELECT *
FROM `denda`