app/Controllers/Home.php

SELECT `peminjaman`.*, `users`.`nama`, `buku`.`judul`
FROM `peminjaman`
LEFT JOIN `users` ON `users`.`id` = `peminjaman`.`id_anggota`
LEFT JOIN `buku` ON `buku`.`id_buku` = `peminjaman`.`id_buku`
ORDER BY `tanggal_pinjam` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows` FROM `buku`
SELECT COUNT(*) AS `numrows` FROM `anggota`
SELECT COUNT(*) AS `numrows` FROM `peminjaman`
---
    public function index(): string
    {
        $bukuModel = new BukuModel();
        $anggotaModel = new AnggotaModel();
        $peminjamanModel = new PeminjamanModel();

        // 👉 INI YANG KAMU TANYA (taruh di sini)
        $peminjaman_terbaru = $peminjamanModel
            ->select('peminjaman.*, users.nama, buku.judul')
            ->join('users', 'users.id = peminjaman.id_anggota', 'left')
            ->join('buku', 'buku.id_buku = peminjaman.id_buku', 'left')
            ->orderBy('tanggal_pinjam', 'DESC')
            ->findAll(5);

        $data = [
            'total_buku' => $bukuModel->countAll(),
            'total_anggota' => $anggotaModel->countAll(),
            'total_peminjaman' => $peminjamanModel->countAll(),
            'peminjaman_terbaru' => $peminjaman_terbaru // ← kirim ke view
        ];