app/Controllers/Kategori.php

    public function index()
    {
        $model = new \App\Models\KategoriModel();

        $keyword = $this->request->getGet('keyword'); // ← ini penting

        if ($keyword) {
            $data['kategori'] = $model->like('nama_kategori', $keyword)->findAll();
        } else {
            $data['kategori'] = $model->findAll();
---
SELECT *
FROM `kategori`