app/Controllers/Peminjaman.php

SELECT `peminjaman`.*, `anggota`.`nama` AS `nama_anggota`, `petugas`.`nama` AS `nama_petugas`, `buku`.`judul`, COALESCE(denda.jumlah_denda, 0) AS denda
FROM `peminjaman`
LEFT JOIN `users` AS `anggota` ON `anggota`.`id` = `peminjaman`.`id_anggota`
LEFT JOIN `users` AS `petugas` ON `petugas`.`id` = `peminjaman`.`id_petugas`
LEFT JOIN `buku` ON `buku`.`id_buku` = `peminjaman`.`id_buku`
LEFT JOIN `denda` ON `denda`.`id_peminjaman` = `peminjaman`.`id_peminjaman`
WHERE `peminjaman`.`id_anggota` = '24'
---
    public function index()
    {
        $builder = $this->peminjaman
            ->select('peminjaman.*,
                anggota.nama AS nama_anggota,
                petugas.nama AS nama_petugas,
                buku.judul,
                COALESCE(denda.jumlah_denda, 0) AS denda')
            ->join('users AS anggota', 'anggota.id = peminjaman.id_anggota', 'left')
            ->join('users AS petugas', 'petugas.id = peminjaman.id_petugas', 'left')
            ->join('buku', 'buku.id_buku = peminjaman.id_buku', 'left')
            ->join('denda', 'denda.id_peminjaman = peminjaman.id_peminjaman', 'left');

        if (session()->get('role') == 'anggota') {
            $builder->where('peminjaman.id_anggota', session()->get('id'));
        }

        $data['peminjaman'] = $builder->findAll();

SELECT *
FROM `anggota`
WHERE `user_id` IS NULL
 LIMIT 1
---
    public function create()
    {
        $anggotaModel = new \App\Models\AnggotaModel();

        $anggota = $anggotaModel
            ->where('user_id', session()->get('id'))
            ->first();