app/Controllers/Penerbit.php

SELECT *
FROM `penerbit`
---
    public function index()
    {
        $model = new \App\Models\PenerbitModel();

        $keyword = $this->request->getGet('keyword');

        if ($keyword) {
            $data['penerbit'] = $model->like('nama_penerbit', $keyword)->findAll();
        } else {
            $data['penerbit'] = $model->findAll();