app/Controllers/Pengembalian.php

SELECT *
FROM `pengembalian`
---
    public function index()
    {
        $model = new \App\Models\PengembalianModel();

        $keyword = $this->request->getGet('keyword');

        $builder = $model;

        if ($keyword) {
            $builder = $builder
                ->like('id_peminjaman', $keyword)
                ->orLike('tanggal_dikembalikan', $keyword)
                ->orLike('denda', $keyword);
        }

        $data['pengembalian'] = $builder->findAll();

SELECT *
FROM `peminjaman`
---
    public function create()
    {
        $peminjamanModel = new PeminjamanModel();

        return view('pengembalian/create', [
            'peminjaman' => $peminjamanModel->findAll()
        ]);